lvgl/lv_port_nxp_imxrt1170-evkb/drivers/fsl_gpc.h
/* @brief _gpc_setpoint_map GPC setpoint map. */
enum
{
    kGPC_SetPoint0  = 1UL << 0UL,  /*!< GPC set point 0. */
    kGPC_SetPoint1  = 1UL << 1UL,  /*!< GPC set point 1. */
    kGPC_SetPoint2  = 1UL << 2UL,  /*!< GPC set point 2. */
    kGPC_SetPoint3  = 1UL << 3UL,  /*!< GPC set point 3. */
    kGPC_SetPoint4  = 1UL << 4UL,  /*!< GPC set point 4. */
    kGPC_SetPoint5  = 1UL << 5UL,  /*!< GPC set point 5. */
    kGPC_SetPoint6  = 1UL << 6UL,  /*!< GPC set point 6. */
    kGPC_SetPoint7  = 1UL << 7UL,  /*!< GPC set point 7. */
    kGPC_SetPoint8  = 1UL << 8UL,  /*!< GPC set point 8. */
    kGPC_SetPoint9  = 1UL << 9UL,  /*!< GPC set point 9. */
    kGPC_SetPoint10 = 1UL << 10UL, /*!< GPC set point 10. */
    kGPC_SetPoint11 = 1UL << 11UL, /*!< GPC set point 11. */
    kGPC_SetPoint12 = 1UL << 12UL, /*!< GPC set point 12. */
    kGPC_SetPoint13 = 1UL << 13UL, /*!< GPC set point 13. */
    kGPC_SetPoint14 = 1UL << 14UL, /*!< GPC set point 14. */
    kGPC_SetPoint15 = 1UL << 15UL, /*!< GPC set point 15. */
};

/*!
 * @brief _gpc_cm_interrupt_status_flag
 */
enum
{
    kGPC_CM_SoftSPNotAllowedStatusFlag  = GPC_CPU_MODE_CTRL_CM_INT_CTRL_SP_REQ_NOT_ALLOWED_SOFT_INT_MASK,
    kGPC_CM_WaitSPNotAllowedStatusFlag  = GPC_CPU_MODE_CTRL_CM_INT_CTRL_SP_REQ_NOT_ALLOWED_WAKEUP_INT_MASK,
    kGPC_CM_SleepSPNotAllowedStatusFlag = GPC_CPU_MODE_CTRL_CM_INT_CTRL_SP_REQ_NOT_ALLOWED_SLEEP_INT_MASK,
};

/*! @brief CPU standby mode status. */
typedef enum _gpc_cm_standby_mode_status
{
    kGPC_CM_SleepBusy = GPC_STAT(
        GPC_CPU_MODE_CTRL_CM_STBY_CTRL_STBY_SLEEP_BUSY_MASK,
        GPC_CPU_MODE_CTRL_CM_STBY_CTRL_STBY_SLEEP_BUSY_SHIFT), /*!< Indicate the CPU is busy entering standby mode. */
    kGPC_CM_WakeupBusy = GPC_STAT(
        GPC_CPU_MODE_CTRL_CM_STBY_CTRL_STBY_WAKEUP_BUSY_MASK,
        GPC_CPU_MODE_CTRL_CM_STBY_CTRL_STBY_WAKEUP_BUSY_SHIFT), /*!< Indicate the CPU is busy exiting standby mode. */
} gpc_cm_standby_mode_status_t;

/*! @brief CPU mode transition step in sleep/wakeup sequence. */
typedef enum _gpc_cm_tran_step
{
    kGPC_CM_SleepSsar   = 0UL,  /*!< SSAR (State Save And Restore) sleep step. */
    kGPC_CM_SleepLpcg   = 1UL,  /*!< LPCG (Low Power Clock Gating) sleep step. */
    kGPC_CM_SleepPll    = 2UL,  /*!< PLL sleep step. */
    kGPC_CM_SleepIso    = 3UL,  /*!< ISO (Isolation) sleep step. */
    kGPC_CM_SleepReset  = 4UL,  /*!< Reset sleep step. */
    kGPC_CM_SleepPower  = 5UL,  /*!< Power sleep step. */
    kGPC_CM_SleepSP     = 6UL,  /*!< Setpoint sleep step. Note that this step is controlled by setpoint controller. */
    kGPC_CM_SleepSTBY   = 7UL,  /*!< Standby sleep step. Note that this step is controlled by standby controller. */
    kGPC_CM_WakeupSTBY  = 8UL,  /*!< Standby wakeup step. Note that this step is controlled by standby controller. */
    kGPC_CM_WakeupSP    = 9UL,  /*!< Setpoint wakeup step. Note that this step is controlled by setpoint countroller. */
    kGPC_CM_WakeupPower = 10UL, /*!< Power wakeup step. */
    kGPC_CM_WakeupReset = 11UL, /*!< Reset wakeup step. */
    kGPC_CM_WakeupIso   = 12UL, /*!< ISO wakeup step. */
    kGPC_CM_WakeupPll   = 13UL, /*!< PLL wakeup step. */
    kGPC_CM_WakeupLpcg  = 14UL, /*!< LPCG wakeup step. */
    kGPC_CM_WakeupSsar  = 15UL, /*!< SSAR wakeup step. */
} gpc_cm_tran_step_t;

/*! @brief Step counter work mode. */
typedef enum _gpc_tran_step_counter_mode
{
    kGPC_StepCounterDisableMode =
        0UL, /*!< Counter disable mode: not use step counter, step completes once receiving step_done. */
    kGPC_StepCounterDelayMode =
        1UL, /*!< Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT */
    kGPC_StepCounterIgnoreResponseMode = 2UL, /*!< Ignore step_done response, the counter starts to count once step
                                                    begins, when counter reaches STEP_CNT value, the step completes. */
    kGPC_StepCounterTimeOutMode = 3UL,        /*!< Time out mode, the counter starts to count once step begins, the step
                                                    completes when either step_done received or counting to STEP_CNT value. */
} gpc_tran_step_counter_mode_t;

/*! @brief GPC set point transition steps. */
typedef enum _gpc_sp_tran_step
{
    kGPC_SP_SsarSave         = 0UL,  /*!< SSAR save step. */
    kGPC_SP_LpcgOff          = 1UL,  /*!< LPCG off step. */
    kGPC_SP_GroupDown        = 2UL,  /*!< Group down step. */
    kGPC_SP_RootDown         = 3UL,  /*!< Root down step. */
    kGPC_SP_PllOff           = 4UL,  /*!< PLL off step. */
    kGPC_SP_IsoOn            = 5UL,  /*!< ISO on. */
    kGPC_SP_ResetEarly       = 6UL,  /*!< Reset early step. */
    kGPC_SP_PowerOff         = 7UL,  /*!< Power off step. */
    kGPC_SP_BiasOff          = 8UL,  /*!< Bias off step. */
    kGPC_SP_BandgapPllLdoOff = 9UL,  /*!< Bandgap and PLL_LDO off step. */
    kGPC_SP_LdoPre           = 10UL, /*!< LDO (Low-Dropout) pre step. */
    kGPC_SP_DcdcDown         = 11UL, /*!< DCDC down step. */
    kGPC_SP_DcdcUp           = 12UL, /*!< DCDC up step. */
    kGPC_SP_LdoPost          = 13UL, /*!< LDO post step. */
    kGPC_SP_BandgapPllLdoOn  = 14UL, /*!< Bandgap and PLL_LDO on step. */
    kGPC_SP_BiasOn           = 15UL, /*!< Bias on step. */
    kGPC_SP_PowerOn          = 16UL, /*!< Power on step. */
    kGPC_SP_ResetLate        = 17UL, /*!< Reset late step. */
    kGPC_SP_IsoOff           = 18UL, /*!< ISO off step. */
    kGPC_SP_PllOn            = 19UL, /*!< PLL on step */
    kGPC_SP_RootUp           = 20UL, /*!< Root up step. */
    kGPC_SP_GroupUp          = 21UL, /*!< Group up step. */
    kGPC_SP_LpcgOn           = 22UL, /*!< LPCG on step. */
    kGPC_SP_SsarRestore      = 23UL, /*!< SSAR restore step. */
} gpc_sp_tran_step_t;

/*! @brief CPU mode. */
typedef enum _gpc_cpu_mode
{
    kGPC_RunMode     = 0x0UL, /*!< Stay in RUN mode. */
    kGPC_WaitMode    = 0x1UL, /*!< Transit to WAIT mode. */
    kGPC_StopMode    = 0x2UL, /*!< Transit to STOP mode. */
    kGPC_SuspendMode = 0x3UL, /*!< Transit to SUSPEND mode. */
} gpc_cpu_mode_t;

