lvgl/lv_port_nxp_imxrt1170-evkb/drivers/fsl_gpc.h
/*! @brief Configuration for GPC transition step. */
typedef struct _gpc_tran_step_config
{
    uint32_t stepCount;                   /*!< Step count, which is depended on the value of cntMode. */
    gpc_tran_step_counter_mode_t cntMode; /*!< Step counter working mode. */
    bool enableStep;                      /*!< Enable the step. */
} gpc_tran_step_config_t;

/*! @brief CPU wakeup sequence setpoint options. */
typedef enum _gpc_cm_wakeup_sp_sel
{
    kGPC_CM_WakeupSetpoint =
        0UL, /*!< Request SP transition to CPU_SP_WAKEUP (param "setPointWakeup" in gpc_cm_sleep_sp_tran_config_t). */
    kGPC_CM_RequestPreviousSetpoint = 1UL, /*!< Request SP transition to the set point when the sleep event happens. */
} gpc_cm_wakeup_sp_sel_t;

/*! @brief GPC standby mode transition steps. */
typedef enum _gpc_stby_tran_step
{
    kGPC_STBY_LpcgIn     = 0UL,  /*!< LPCG in step. */
    kGPC_STBY_PllIn      = 1UL,  /*!< PLL in step. */
    kGPC_STBY_BiasIn     = 2UL,  /*!< Bias in step. */
    kGPC_STBY_PldoIn     = 3UL,  /*!< PLDO in step. */
    kGPC_STBY_BandgapIn  = 4UL,  /*!< Bandgap in step. */
    kGPC_STBY_LdoIn      = 5UL,  /*!< LDO in step. */
    kGPC_STBY_DcdcIn     = 6UL,  /*!< DCDC in step. */
    kGPC_STBY_PmicIn     = 7UL,  /*!< PMIC in step. */
    kGPC_STBY_PmicOut    = 8UL,  /*!< PMIC out step. */
    kGPC_STBY_DcdcOut    = 9UL,  /*!< DCDC out step. */
    kGPC_STBY_LdoOut     = 10UL, /*!< LDO out step. */
    kGPC_STBY_BandgapOut = 11UL, /*!< Bandgap out step. */
    kGPC_STBY_PldoOut    = 12UL, /*!< PLDO out step. */
    kGPC_STBY_BiasOut    = 13UL, /*!< Bias out step. */
    kGPC_STBY_PllOut     = 14UL, /*!< PLL out step. */
    kGPC_STBY_LpcgOut    = 15UL, /*!< LPCG out step. */
} gpc_stby_tran_step_t;

/*!
 * @brief GPC CPU domain name, used to select the CPU domain.
 */
typedef enum _gpc_cpu_domain_name
{
    kGPC_CM7Core = 0U, /*!< CM7 core. */
    kGPC_CM4Core = 1U, /*!< CM4 core. */
} gpc_cpu_domain_name_t;
/*******************************************************************************
 * API
 ******************************************************************************/
#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @name CPU mode control
 * @{
 */

/*
 * @brief Hold core in sleep state.
 *
 * This function is used to hold the core in sleep state once it enters WFI, and until finishing wakeup sequence. If a
 * wakeup IRQ happens during the delay between core sleeps and core clock stops, the core will be woken up but GPC is on
 * sleep sequence and shut off the clock when core is processing the IRQ, this may leads to an unpredictable status.
 *
 * @param base GPC CPU module base address.
 */
static inline void GPC_CM_EnableCpuSleepHold(GPC_CPU_MODE_CTRL_Type *base, bool enable)
{
    if (enable)
    {
        base->CM_MISC |= GPC_CPU_MODE_CTRL_CM_MISC_SLEEP_HOLD_EN_MASK;
    }
    else
    {
        base->CM_MISC &= ~GPC_CPU_MODE_CTRL_CM_MISC_SLEEP_HOLD_EN_MASK;
    }
}

/*!
 * @brief Set the CPU mode on the next sleep event.
 *
 * This function configures the CPU mode that the CPU core will transmit to on next sleep event.
 *
 * @note This API must be called each time before entering sleep.
 *
 * @param base GPC CPU module base address.
 * @param mode The CPU mode that the core will transmit to, refer to "gpc_cpu_mode_t".
 */
static inline void GPC_CM_SetNextCpuMode(GPC_CPU_MODE_CTRL_Type *base, gpc_cpu_mode_t mode)
{
    base->CM_MODE_CTRL = (base->CM_MODE_CTRL & ~GPC_CPU_MODE_CTRL_CM_MODE_CTRL_CPU_MODE_TARGET_MASK) |
                         GPC_CPU_MODE_CTRL_CM_MODE_CTRL_CPU_MODE_TARGET(mode);
}

/*!
 * @brief Get current CPU mode.
 *
 * @param base GPC CPU module base address.
 * @return The current CPU mode, in type of @ref gpc_cpu_mode_t.
 */
static inline gpc_cpu_mode_t GPC_CM_GetCurrentCpuMode(GPC_CPU_MODE_CTRL_Type *base)
{
    return (gpc_cpu_mode_t)(uint32_t)((base->CM_MODE_STAT & GPC_CPU_MODE_CTRL_CM_MODE_STAT_CPU_MODE_CURRENT_MASK) >>
                                      GPC_CPU_MODE_CTRL_CM_MODE_STAT_CPU_MODE_CURRENT_SHIFT);
}

/*!
 * @brief Get previous CPU mode.
 *
 * @param base GPC CPU module base address.
 * @return The previous CPU mode, in type of @ref gpc_cpu_mode_t.
 */
static inline gpc_cpu_mode_t GPC_CM_GetPreviousCpuMode(GPC_CPU_MODE_CTRL_Type *base)
{
    return (gpc_cpu_mode_t)(uint32_t)((base->CM_MODE_STAT & GPC_CPU_MODE_CTRL_CM_MODE_STAT_CPU_MODE_PREVIOUS_MASK) >>
                                      GPC_CPU_MODE_CTRL_CM_MODE_STAT_CPU_MODE_PREVIOUS_SHIFT);
}

/*!
 * @brief Enable IRQ wakeup request.
 *
 * This function enables the IRQ request which can wakeup the CPU platform.
 *
 * @param base GPC CPU module base address.
 * @param irqId ID of the IRQ, accessible range is 0-255.
 * @param enable Enable the IRQ request or not.
 */
void GPC_CM_EnableIrqWakeup(GPC_CPU_MODE_CTRL_Type *base, uint32_t irqId, bool enable);

/*!
 * @brief Enable Non-IRQ wakeup request.
 *
 * This function enables the non-IRQ request which can wakeup the CPU platform.
 *
 * @param base GPC CPU module base address.
 * @param mask Non-IRQ type, refer to "_gpc_cm_non_irq_wakeup_request".
 * @param enable Enable the Non-IRQ request or not.
 */
static inline void GPC_CM_EnableNonIrqWakeup(GPC_CPU_MODE_CTRL_Type *base, uint32_t mask, bool enable)
{
    if (true == enable)
    {
        base->CM_NON_IRQ_WAKEUP_MASK &= ~mask;
    }
    else
    {
        base->CM_NON_IRQ_WAKEUP_MASK |= mask;
    }
}

/*!
 * @brief Get the status of the IRQ wakeup request.
 *
 * @param base GPC CPU module base address.
 * @param irqId ID of the IRQ, accessible range is 0-255.
 * @return Indicate the IRQ request is asserted or not.
 */
bool GPC_CM_GetIrqWakeupStatus(GPC_CPU_MODE_CTRL_Type *base, uint32_t irqId);

/*!
 * @brief Get the status of the Non-IRQ wakeup request.
 *
 * @param base GPC CPU module base address.
 * @param mask Non-IRQ type, refer to "_gpc_cm_non_irq_wakeup_request".
 * @return Indicate the Non-IRQ request is asserted or not.
 */
static inline bool GPC_CM_GetNonIrqWakeupStatus(GPC_CPU_MODE_CTRL_Type *base, uint32_t mask)
{
    return (mask == (base->CM_NON_IRQ_WAKEUP_STAT & mask));
}

/*!
 * @brief Config the cpu mode transition step.
 *
 * @note This function can not config the setpoint sleep/wakeup operation for those
 * operation is controlled by setpoint control. This funcion can not config the standby
 * sleep/wakeup too, because those operation is controlled by standby controlled.
 *
 * @param base GPC CPU module base address.
 * @param step step type, refer to "gpc_cm_tran_step_t".
 * @param config transition step configuration, refer to "gpc_tran_step_config_t".
 */
void GPC_CM_ConfigCpuModeTransitionStep(GPC_CPU_MODE_CTRL_Type *base,
                                        gpc_cm_tran_step_t step,
                                        const gpc_tran_step_config_t *config);

/*!
 * @brief Request a set point transition before the CPU transfers into a sleep mode.
 *
 * This function triggers the set point transition during a CPU Sleep/wakeup event and selects which one the CMC want
 * to transfer to.
 *
 * @param base GPC CPU module base address.
 * @param setPointSleep The set point CPU want the system to transit to on next CPU platform sleep sequence.
 * @param setPointWakeup The set point CPU want the system to transit to on next CPU platform wakeup sequence.
 * @param wakeupSel Select the set point transition on the next CPU platform wakeup sequence.
 */
void GPC_CM_RequestSleepModeSetPointTransition(GPC_CPU_MODE_CTRL_Type *base,
                                               uint8_t setPointSleep,
                                               uint8_t setPointWakeup,
                                               gpc_cm_wakeup_sp_sel_t wakeupSel);

/*!
 * @brief Request a set point transition during run mode.
 *
 * This function triggers the set point transition and selects which one the CMC want to transfer to.
 *
 * @param base GPC CPU module base address.
 * @param setPointRun The set point CPU want the system to transit in the run mode.
 */
void GPC_CM_RequestRunModeSetPointTransition(GPC_CPU_MODE_CTRL_Type *base, uint8_t setPointRun);

/*!
 * @brief Set the set point mapping value for each set point.
 *
 * This function configures which set point is allowed after current set point. If there are multiple setpoints, use:
 * @code
 *    setpoint_map = kGPC_SetPoint0 | kGPC_SetPoint1 | ... | kGPC_SetPoint15;
 * @endcode
 *
 * @param base GPC CPU module base address.
 * @param setPoint Set point index, available range is 0-15.
 * @param setpoint_map Map value of the set point. Refer to "_gpc_setpoint_map".
 */
static inline void GPC_CM_SetSetPointMapping(GPC_CPU_MODE_CTRL_Type *base, uint32_t setPoint, uint32_t setpoint_map)
{
    assert(setPoint < 16UL);

    base->CM_SP_MAPPING[setPoint] = (setpoint_map & 0xFFFFUL);
}

/*!
 * @brief Set the set point mapping value for each cpu mode.
 *
 * This function configures which set point is allowed when CPU enters RUN/WAIT/STOP/SUSPEND. If there are multiple
 * setpoints, use:
 * @code
 *    setpoint_map = kGPC_SetPoint0 | kGPC_SetPoint1 | ... | kGPC_SetPoint15;
 * @endcode
 *
 * @param base GPC CPU module base address.
 * @param mode CPU mode. Refer to "gpc_cpu_mode_t".
 * @param setpoint_map Map value of the set point. Refer to "_gpc_setpoint_map".
 */
void GPC_CM_SetCpuModeSetPointMapping(GPC_CPU_MODE_CTRL_Type *base, gpc_cpu_mode_t mode, uint32_t setpoint_map);

/*!
 * @brief Request the chip into standby mode.
 *
 * @param base GPC CPU module base address.
 * @param mode CPU mode. Refer to "gpc_cpu_mode_t".
 */
void GPC_CM_RequestStandbyMode(GPC_CPU_MODE_CTRL_Type *base, const gpc_cpu_mode_t mode);

/*!
 * @brief Clear the standby mode request.
 *
 * @param base GPC CPU module base address.
 * @param mode CPU mode. Refer to "gpc_cpu_mode_t".
 */
void GPC_CM_ClearStandbyModeRequest(GPC_CPU_MODE_CTRL_Type *base, const gpc_cpu_mode_t mode);

/*!
 * @brief Get the status of the CPU standby mode transition.
 *
 * @param base GPC CPU module base address.
 * @param mask Standby mode transition status mask, refer to "gpc_cm_standby_mode_status_t".
 * @return Indicate the CPU's standby transition status.
 */
static inline bool GPC_CM_GetStandbyModeStatus(GPC_CPU_MODE_CTRL_Type *base, uint32_t mask)
{
    return (mask == (base->CM_STBY_CTRL & mask));
}

/*!
 * @brief Get the status flags of the GPC CPU module.
 *
 * @param base GPC CPU module base address.
 * @return The OR'ed value of status flags.
 */
static inline uint32_t GPC_CM_GetInterruptStatusFlags(GPC_CPU_MODE_CTRL_Type *base)
{
    return ((base->CM_INT_CTRL) & GPC_CM_ALL_INTERRUPT_STATUS);
}

/*!
 * @brief Clears CPU module interrut status flags.
 *
 * @param base GPC CPU module base address.
 * @param mask The interrupt status flags to be cleared. Should be the OR'ed value of _gpc_cm_interrupt_status_flag.
 */
void GPC_CM_ClearInterruptStatusFlags(GPC_CPU_MODE_CTRL_Type *base, uint32_t mask);

/*!
 * @}
 */

/*!
 * @name Set point request control
 * @{
 */

/*!
 * @brief Set the priority of set point.
 *
 * This function will configure the priority of the set point. If the result of API GPC_SP_GetAllowedSetPointMap() has
 * more than one valid bit, high priority set point will be taken.
 *
 * @param base GPC Setpoint controller base address.
 * @param setPoint Set point index, available range is 0-15.
 * @param priority Priority level, available range is 0-15.
 */
static inline void GPC_SP_SetSetpointPriority(GPC_SET_POINT_CTRL_Type *base, uint32_t setPoint, uint32_t priority)
{
    assert(priority < 16UL);
    assert(setPoint < 16UL);

    if (setPoint < 8UL)
    {
        base->SP_PRIORITY_0_7 |= (priority << (setPoint * 4UL));
    }
    else
    {
        base->SP_PRIORITY_8_15 |= (priority << ((setPoint - 8UL) * 4UL));
    }
}

/*!
 * @brief Config the set point transition step.
 *
 * @param base GPC Setpoint controller base address.
 * @param step step type, refer to "gpc_sp_tran_step_t".
 * @param config transition step configuration, refer to "gpc_tran_step_config_t".
 */
void GPC_SP_ConfigSetPointTransitionStep(GPC_SET_POINT_CTRL_Type *base,
                                         gpc_sp_tran_step_t step,
                                         const gpc_tran_step_config_t *config);

/*!
 * @brief Get system current setpoint, only valid when setpoint trans not busy.
 *
 * @param base GPC Setpoint controller base address.
 * @return The current setpoint number, range from 0 to 15.
 */
static inline uint8_t GPC_SP_GetCurrentSetPoint(GPC_SET_POINT_CTRL_Type *base)
{
    return (uint8_t)((base->SP_SYS_STAT & GPC_SET_POINT_CTRL_SP_SYS_STAT_SYS_SP_CURRENT_MASK) >>
                     GPC_SET_POINT_CTRL_SP_SYS_STAT_SYS_SP_CURRENT_SHIFT);
}

/*!
 * @brief Get system previous setpoint, only valid when setpoint trans not busy.
 *
 * @param base GPC Setpoint controller base address.
 * @return The previous setpoint number, range from 0 to 15.
 */
static inline uint8_t GPC_SP_GetPreviousSetPoint(GPC_SET_POINT_CTRL_Type *base)
{
    return (uint8_t)((base->SP_SYS_STAT & GPC_SET_POINT_CTRL_SP_SYS_STAT_SYS_SP_PREVIOUS_MASK) >>
                     GPC_SET_POINT_CTRL_SP_SYS_STAT_SYS_SP_PREVIOUS_SHIFT);
}

/*!
 * @brief Get target setpoint.
 *
 * @param base GPC Setpoint controller base address.
 * @return The target setpoint number, range from 0 to 15.
 */
static inline uint8_t GPC_SP_GetTargetSetPoint(GPC_SET_POINT_CTRL_Type *base)
{
    return (uint8_t)((base->SP_SYS_STAT & GPC_SET_POINT_CTRL_SP_SYS_STAT_SYS_SP_TARGET_MASK) >>
                     GPC_SET_POINT_CTRL_SP_SYS_STAT_SYS_SP_TARGET_SHIFT);
}
/*!
 * @}
 */

/*!
 * @name Standby mode control
 * @{
 */

/*!
 * @brief Config the standby transition step.
 *
 * @param base GPC standby controller base address.
 * @param step step type, refer to "gpc_stby_tran_step_t".
 * @param config transition step configuration, refer to "gpc_tran_step_config_t".
 */
void GPC_STBY_ConfigStandbyTransitionStep(GPC_STBY_CTRL_Type *base,
                                          gpc_stby_tran_step_t step,
                                          const gpc_tran_step_config_t *config);

/*!
 * @brief Force selected CPU requesting standby mode.
 *
 * @param base GPC standby controller base address.
 * @param cpuName The CPU name, refer to @ref gpc_cpu_domain_name_t.
 */
static inline void GPC_STBY_ForceCoreRequestStandbyMode(GPC_STBY_CTRL_Type *base, gpc_cpu_domain_name_t cpuName)
{
    base->STBY_MISC |= ((uint32_t)GPC_STBY_CTRL_STBY_MISC_FORCE_CPU0_STBY_MASK << (uint32_t)cpuName);
}
/*!
 * @}
 */

#if defined(__cplusplus)
}
#endif
/*!
 * @}
 */
#endif /* _FSL_GPC_H_ */
